# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [12.64, 19.39, 37.88, 51.48, 55.71, 138.31]  # 16
  - [126.91, 78.23, 131.57, 214.55, 279.92, 258.87]  # 32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, SimConv, [24, 3, 2]],  # 0-P1/2
   [-1, 1, nn.MaxPool2d, [24, 3, 2, 1]],  # 1-P2/4
   [-1, 4, ShuffleNetV2x, [48, 3, 2]], #stage2/8
   [-1, 8, ShuffleNetV2x, [96, 3, 2]], # 3- stage3/16 C2
   [-1, 4, ShuffleNetV2x, [192, 3, 2]], # 4- stage4/32 C3
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, SimConv, [72, 1, 1]], #5-S3
   [-1, 1, DWConvblockX, [72, 5]], #6-cls_3, obj_3
   [5, 1, DWConvblockX, [72, 5]],  #7-reg_3

   [4, 1, nn.Upsample, [None, 2, 'nearest']], 
   [[-1, 3], 1, Concat, [1]],  # p2
   [-1, 1, SimConv, [72, 1, 1]],  # 10-S2
   [-1, 1, DWConvblockX, [72, 5]], #11-cls_2, obj_2
   [10, 1, DWConvblockX, [72, 5]], #12-reg_2

   [[12, 11, 7, 6], 1, DetectFaster, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
