# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors: 1  # number of anchors

# PP-YOLOE backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ConvBNLayer, [32, 3, 2, 1, 'swish']],      # 0-P1/2
   [-1, 1, ConvBNLayer, [64, 3, 1, 1, 'swish']],      # 1
   [-1, 1, CSPResStage, [128, 3, 2,   'swish']],      # 2-P2/4
   [-1, 1, CSPResStage, [256, 6, 2,   'swish']],      # 3-P3/8
   [-1, 1, CSPResStage, [512, 6, 2,   'swish']],      # 4-P4/16
   [-1, 1, CSPResStage, [1024, 3, 2,  'swish']],      # 5-P5/32
  ]

# PP-YOLOE head
head:
  [[-1, 1, CSPStage, [1024, 3, 'lrelu', True]],       # 6  [b, 512, 20, 20]
   [-1, 1, ConvBNLayer, [512, 1, 1, 0, 'lrelu']],     # 7
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],        # 8

   [[-1, 4], 1, Concat, [1]],                         # 9 cat backbone P4
   [ -1, 1, CSPStage, [512, 3, 'lrelu', False]],      # 10 [b, 256, 40, 40]
   [ -1, 1, ConvBNLayer, [256, 1, 1, 0, 'lrelu']],    # 11
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ]],     # 12

   [[-1, 3], 1, Concat, [1]],                         # 13 cat backbone P3
   [ -1, 1, CSPStage, [128, 3, 'lrelu', False]],      # 14 [b, 64, 80, 80]

   [-1, 1, ConvBNLayer, [128, 3, 2, 1, 'lrelu']],     # 15
   [[-1, 10], 1, Concat, [1]],                        # 16 cat head P4
   [-1, 1, CSPStage, [256, 3, 'lrelu', False]],       # 17 (P4/16-medium) [128, 40, 40]

   [-1, 1, ConvBNLayer, [256, 3, 2, 1, 'lrelu']],     # 18
   [[-1, 6], 1, Concat, [1]],                         # 19 cat head P5
   [-1, 1, CSPStage, [512, 3, 'lrelu', False]],       # 20 (P5/32-large)   [256, 20, 20]

   [[14, 17, 20], 1, DetectE, [nc, [64, 128, 256, 512, 1024, 256, 128, 128, 256, 256, 512]]],  # Detect(P3, P4, P5)
  ]
